In [6]:
USE Zugdatenbank;
SELECT MAX(abfahrt) FROM Verbindet, Bahnhoefe WHERE Name = 'Basel SBB'

(No column name)
15:36:00